#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ГСИ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Элементы.ВыходноеПособие.Видимость=Истина;
КонецПроцедуры
#КонецОбласти

<<<<<<< HEAD
=======
#Область СервернаяЧастьОбработчиковСобытийЭлементовФормы
>>>>>>> 6848ce304f12c6710266f7e3a403f461a173982c
#Область ОчиститьОбновитьДанныеПоСотруднику
&НаСервере
&После("РассчитатьКоличествоЧасовКомпенсацииСуммированногоУчетаНаСервере")
Процедура ГСИ_РассчитатьКоличествоЧасовКомпенсацииСуммированногоУчетаНаСервере()
		Объект.Сверхурочно1_5 =0;
КонецПроцедуры
<<<<<<< HEAD
=======
#КонецОбласти   
>>>>>>> 6848ce304f12c6710266f7e3a403f461a173982c
#КонецОбласти