#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ГСИ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЭтаФорма.Элементы.ВыходноеПособие.Видимость=Истина;
КонецПроцедуры
#КонецОбласти

#Область СервернаяЧастьОбработчиковСобытийЭлементовФормы
#Область ОчиститьОбновитьДанныеПоСотруднику
&НаСервере
&После("РассчитатьКоличествоЧасовКомпенсацииСуммированногоУчетаНаСервере")
Процедура ГСИ_РассчитатьКоличествоЧасовКомпенсацииСуммированногоУчетаНаСервере()
		Объект.Сверхурочно1_5 =0;
КонецПроцедуры
#КонецОбласти   
#КонецОбласти