
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ГСИ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ГСИ_УправлениеФормой.СоздатьТаблицуФормы(ЭтотОбъект);          
	ГСИ_УправлениеФормой.ЗаполнитьТаблицуФормы(ЭтотОбъект);
	ГСИ_УправлениеФормой.УстановитьВидимостьРеквизитаТаблицы(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ГСИ_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ГСИ_УправлениеФормой.ЗаписатьТаблицу(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

//@skip-check extension-method-prefix
&НаКлиенте
Процедура Подключаемый_ТаблицаДнейПоМесяцамПериодПриИзменении(Элемент)
	  Элементы.ТаблицаДнейПоМесяцам.ТекущиеДанные.Период=НачалоМесяца(Элементы.ТаблицаДнейПоМесяцам.ТекущиеДанные.Период);
КонецПроцедуры

#КонецОбласти