
&Вместо("СформироватьЗапросДляТ61")
Функция ГСИ_СформироватьЗапросДляТ61(МассивОбъектов)
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	КадровыйУчет.СоздатьВТДанныеДокументовУвольнение(МенеджерВременныхТаблиц, МассивОбъектов);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МИНИМУМ(НАЧАЛОПЕРИОДА(ДанныеДокументов.МесяцНачалаРасчетов, МЕСЯЦ)), ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоПериода,
		|	ЕСТЬNULL(МАКСИМУМ(КОНЕЦПЕРИОДА(ДанныеДокументов.МесяцНачисления, МЕСЯЦ)), ДАТАВРЕМЯ(1, 1, 1)) КАК КонецПериода
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запрос.УстановитьПараметр("НачалоПериода", Выборка.НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", Выборка.КонецПериода);
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", '00010101');
		Запрос.УстановитьПараметр("КонецПериода", '00010101');
	КонецЕсли;
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		Запрос.МенеджерВременныхТаблиц,
		"ВТДанныеДокументов");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
		ОписательВременныхТаблиц,
		Истина,
		"ФИОПолные,ТабельныйНомер,Организация,Подразделение,Должность,ТарифнаяСтавка,ДатаПриема,ДатаУвольнения,ФизическоеЛицо,РазрядКатегория,Пол,ТрудовойДоговорДата,ТрудовойДоговорНомер");
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("Руководитель");
	ИменаПолейОтветственныхЛиц.Добавить("Бухгалтер");
	ИменаПолейОтветственныхЛиц.Добавить("РаботникКадровойСлужбы");
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Ложь, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументов");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документы.Ссылка
	|ИЗ
	|	ВТДанныеДокументов КАК Документы
	|ГДЕ
	|	Документы.Ссылка ССЫЛКА Документ.Увольнение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документы.Ссылка
	|ИЗ
	|	ВТДанныеДокументов КАК Документы
	|ГДЕ
	|	Документы.Ссылка ССЫЛКА Документ.УвольнениеСписком";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ИсправлениеДокументовЗарплатаКадры.СоздатьВТИсправленныеДокументы(Запрос.МенеджерВременныхТаблиц, Результаты[0].Выгрузить().ВыгрузитьКолонку("Ссылка"), "Увольнение", "ВТИсправленныеДокументыУвольнений");	
	ИсправлениеДокументовЗарплатаКадры.СоздатьВТИсправленныеДокументы(Запрос.МенеджерВременныхТаблиц, Результаты[1].Выгрузить().ВыгрузитьКолонку("Ссылка"), "УвольнениеСписком", "ВТИсправленныеДокументыУвольненийСписком");	
	
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсправленныеДокументыУвольнений.Ссылка КАК Ссылка,
		|	ИсправленныеДокументыУвольнений.ИсправленныйДокумент КАК ДокументЦепочки,
		|	ИсправленныеДокументыУвольнений.Ссылка.ПериодРегистрации = ИсправленныеДокументыУвольнений.ИсправленныйДокумент.ПериодРегистрации КАК ВТекущемПериоде
		|ПОМЕСТИТЬ ВТЦепочкаУвольнений
		|ИЗ
		|	ВТИсправленныеДокументыУвольнений КАК ИсправленныеДокументыУвольнений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка,
		|	Ложь
		|ИЗ
		|	Документ.Увольнение КАК Увольнение
		|ГДЕ
		|	Увольнение.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсправленныеДокументыУвольнений.Ссылка КАК Ссылка,
		|	ИсправленныеДокументыУвольнений.ИсправленныйДокумент КАК ДокументЦепочки
		|ПОМЕСТИТЬ ВТЦепочкаУвольненийСписком
		|ИЗ
		|	ВТИсправленныеДокументыУвольненийСписком КАК ИсправленныеДокументыУвольнений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка
		|ИЗ
		|	Документ.УвольнениеСписком КАК Увольнение
		|ГДЕ
		|	Увольнение.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДнейКомпенсацииУдержанияОтпуска.Ссылка,
		|	ДнейКомпенсацииУдержанияОтпуска.Сотрудник,
		|	СУММА(ДнейКомпенсацииУдержанияОтпуска.ДнейКомпенсации) КАК ДнейКомпенсации,
		|	СУММА(ДнейКомпенсацииУдержанияОтпуска.ДнейУдержания) КАК ДнейУдержания
		|ПОМЕСТИТЬ ВТДнейКомпенсацииУдержанияОтпуска
		|ИЗ
		|	(ВЫБРАТЬ
		|		УвольнениеДополнительныеОтпуска.Ссылка КАК Ссылка,
		|		УвольнениеДополнительныеОтпуска.Ссылка.Сотрудник КАК Сотрудник,
		|		СУММА(ВЫБОР
		|				КОГДА УвольнениеДополнительныеОтпуска.ПризнакКомпенсацииУдержания = ЗНАЧЕНИЕ(Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении.КомпенсироватьНеИспользованные)
		|					ТОГДА УвольнениеДополнительныеОтпуска.ДнейКомпенсацииУдержания
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК ДнейКомпенсации,
		|		СУММА(ВЫБОР
		|				КОГДА УвольнениеДополнительныеОтпуска.ПризнакКомпенсацииУдержания = ЗНАЧЕНИЕ(Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении.УдержатьЗаИспользованныеАвансом)
		|					ТОГДА УвольнениеДополнительныеОтпуска.ДнейКомпенсацииУдержания
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК ДнейУдержания
		|	ИЗ
		|		Документ.Увольнение.ДополнительныеОтпуска КАК УвольнениеДополнительныеОтпуска
		|	ГДЕ
		|		УвольнениеДополнительныеОтпуска.Ссылка В
		|				(ВЫБРАТЬ
		|					Документы.Ссылка
		|				ИЗ
		|					ВТДанныеДокументов КАК Документы)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УвольнениеДополнительныеОтпуска.Ссылка,
		|		УвольнениеДополнительныеОтпуска.Ссылка.Сотрудник
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Увольнение.Ссылка,
		|		Увольнение.Сотрудник,
		|		СУММА(ВЫБОР
		|				КОГДА Увольнение.ПризнакКомпенсацииУдержанияОтпуска = ЗНАЧЕНИЕ(Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении.КомпенсироватьНеИспользованные)
		|					ТОГДА Увольнение.ДнейКомпенсацииУдержанияОтпуска
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА Увольнение.ПризнакКомпенсацииУдержанияОтпуска = ЗНАЧЕНИЕ(Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении.УдержатьЗаИспользованныеАвансом)
		|					ТОГДА Увольнение.ДнейКомпенсацииУдержанияОтпуска
		|				ИНАЧЕ 0
		|			КОНЕЦ)
		|	ИЗ
		|		Документ.Увольнение КАК Увольнение
		|	ГДЕ
		|		Увольнение.Ссылка В
		|				(ВЫБРАТЬ
		|					Документы.Ссылка
		|				ИЗ
		|					ВТДанныеДокументов КАК Документы)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Увольнение.Ссылка,
		|		Увольнение.Сотрудник
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		УвольнениеДополнительныеОтпуска.Ссылка,
		|		УвольнениеСотрудники.Сотрудник,
		|		СУММА(ВЫБОР
		|				КОГДА УвольнениеДополнительныеОтпуска.ПризнакКомпенсацииУдержания = ЗНАЧЕНИЕ(Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении.КомпенсироватьНеИспользованные)
		|					ТОГДА УвольнениеДополнительныеОтпуска.ДнейКомпенсацииУдержания
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА УвольнениеДополнительныеОтпуска.ПризнакКомпенсацииУдержания = ЗНАЧЕНИЕ(Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении.УдержатьЗаИспользованныеАвансом)
		|					ТОГДА УвольнениеДополнительныеОтпуска.ДнейКомпенсацииУдержания
		|				ИНАЧЕ 0
		|			КОНЕЦ)
		|	ИЗ
		|		Документ.УвольнениеСписком.ДополнительныеОтпуска КАК УвольнениеДополнительныеОтпуска
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСотрудники
		|			ПО УвольнениеДополнительныеОтпуска.Ссылка = УвольнениеСотрудники.Ссылка
		|				И УвольнениеДополнительныеОтпуска.ИдентификаторСтрокиСотрудника = УвольнениеСотрудники.ИдентификаторСтрокиСотрудника
		|	ГДЕ
		|		УвольнениеДополнительныеОтпуска.Ссылка В
		|				(ВЫБРАТЬ
		|					Документы.Ссылка
		|				ИЗ
		|					ВТДанныеДокументов КАК Документы)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		УвольнениеДополнительныеОтпуска.Ссылка,
		|		УвольнениеСотрудники.Сотрудник
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Увольнение.Ссылка,
		|		Увольнение.Сотрудник,
		|		СУММА(ВЫБОР
		|				КОГДА Увольнение.ПризнакКомпенсацииУдержанияОтпуска = ЗНАЧЕНИЕ(Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении.КомпенсироватьНеИспользованные)
		|					ТОГДА Увольнение.ДнейКомпенсацииУдержанияОтпуска
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА Увольнение.ПризнакКомпенсацииУдержанияОтпуска = ЗНАЧЕНИЕ(Перечисление.КомпенсацияУдержаниеОтпускаПриУвольнении.УдержатьЗаИспользованныеАвансом)
		|					ТОГДА Увольнение.ДнейКомпенсацииУдержанияОтпуска
		|				ИНАЧЕ 0
		|			КОНЕЦ)
		|	ИЗ
		|		Документ.УвольнениеСписком.Сотрудники КАК Увольнение
		|	ГДЕ
		|		Увольнение.Ссылка В
		|				(ВЫБРАТЬ
		|					Документы.Ссылка
		|				ИЗ
		|					ВТДанныеДокументов КАК Документы)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Увольнение.Ссылка,
		|		Увольнение.Сотрудник) КАК ДнейКомпенсацииУдержанияОтпуска
		|
		|СГРУППИРОВАТЬ ПО
		|	ДнейКомпенсацииУдержанияОтпуска.Ссылка,
		|	ДнейКомпенсацииУдержанияОтпуска.Сотрудник";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УвольнениеНачисления.Ссылка КАК Ссылка,
		|	УвольнениеНачисления.Сотрудник.ГоловнойСотрудник КАК Сотрудник,
		|	СУММА(УвольнениеНачисления.Результат) КАК ВсегоВыплат,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА УвольнениеНачисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоКВыплате,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА УвольнениеНачисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачисленоКомпенсации,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА УвольнениеНачисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачисленоВыходноеПособиеСохраняемыйЗаработок,
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ УвольнениеНачисления.Результат
		|		КОНЕЦ) КАК ВсеДругиеНачисления
		|ПОМЕСТИТЬ ВТНачисленияПредварительно
		|ИЗ
		|	Документ.Увольнение.Начисления КАК УвольнениеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО УвольнениеНачисления.Начисление = Начисления.Ссылка
		|ГДЕ
		|	УвольнениеНачисления.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеНачисления.Ссылка,
		|	УвольнениеНачисления.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвольнениеНачисления.Ссылка,
		|	УвольнениеНачисления.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеНачисления.Результат),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА УвольнениеНачисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА УвольнениеНачисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА УвольнениеНачисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ УвольнениеНачисления.Результат
		|		КОНЕЦ)
		|ИЗ
		|	Документ.УвольнениеСписком.Начисления КАК УвольнениеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО УвольнениеНачисления.Начисление = Начисления.Ссылка
		|ГДЕ
		|	УвольнениеНачисления.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеНачисления.Ссылка,
		|	УвольнениеНачисления.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвольнениеНачисленияПерерасчет.Ссылка,
		|	УвольнениеНачисленияПерерасчет.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеНачисленияПерерасчет.Результат),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА УвольнениеНачисленияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА УвольнениеНачисленияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА УвольнениеНачисленияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ УвольнениеНачисленияПерерасчет.Результат
		|		КОНЕЦ)
		|ИЗ
		|	Документ.Увольнение.НачисленияПерерасчет КАК УвольнениеНачисленияПерерасчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО УвольнениеНачисленияПерерасчет.Начисление = Начисления.Ссылка
		|ГДЕ
		|	УвольнениеНачисленияПерерасчет.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеНачисленияПерерасчет.Ссылка,
		|	УвольнениеНачисленияПерерасчет.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвольнениеНачисленияПерерасчет.Ссылка,
		|	УвольнениеНачисленияПерерасчет.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеНачисленияПерерасчет.Результат),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА УвольнениеНачисленияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА УвольнениеНачисленияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА УвольнениеНачисленияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ УвольнениеНачисленияПерерасчет.Результат
		|		КОНЕЦ)
		|ИЗ
		|	Документ.УвольнениеСписком.НачисленияПерерасчет КАК УвольнениеНачисленияПерерасчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО УвольнениеНачисленияПерерасчет.Начисление = Начисления.Ссылка
		|ГДЕ
		|	УвольнениеНачисленияПерерасчет.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеНачисленияПерерасчет.Ссылка,
		|	УвольнениеНачисленияПерерасчет.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвольнениеПособия.Ссылка,
		|	УвольнениеПособия.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеПособия.Результат),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА УвольнениеПособия.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА УвольнениеПособия.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА УвольнениеПособия.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ УвольнениеПособия.Результат
		|		КОНЕЦ)
		|ИЗ
		|	Документ.Увольнение.Пособия КАК УвольнениеПособия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО УвольнениеПособия.Начисление = Начисления.Ссылка
		|ГДЕ
		|	УвольнениеПособия.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеПособия.Ссылка,
		|	УвольнениеПособия.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвольнениеПособия.Ссылка,
		|	УвольнениеПособия.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеПособия.Результат),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА УвольнениеПособия.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА УвольнениеПособия.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА УвольнениеПособия.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ УвольнениеПособия.Результат
		|		КОНЕЦ)
		|ИЗ
		|	Документ.УвольнениеСписком.Пособия КАК УвольнениеПособия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО УвольнениеПособия.Начисление = Начисления.Ссылка
		|ГДЕ
		|	УвольнениеПособия.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеПособия.Ссылка,
		|	УвольнениеПособия.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвольнениеПособияПерерасчет.Ссылка,
		|	УвольнениеПособияПерерасчет.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеПособияПерерасчет.Результат),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА УвольнениеПособияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА УвольнениеПособияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА УвольнениеПособияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ УвольнениеПособияПерерасчет.Результат
		|		КОНЕЦ)
		|ИЗ
		|	Документ.Увольнение.ПособияПерерасчет КАК УвольнениеПособияПерерасчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО УвольнениеПособияПерерасчет.Начисление = Начисления.Ссылка
		|ГДЕ
		|	УвольнениеПособияПерерасчет.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеПособияПерерасчет.Ссылка,
		|	УвольнениеПособияПерерасчет.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвольнениеПособияПерерасчет.Ссылка,
		|	УвольнениеПособияПерерасчет.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеПособияПерерасчет.Результат),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА УвольнениеПособияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА УвольнениеПособияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА УвольнениеПособияПерерасчет.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ УвольнениеПособияПерерасчет.Результат
		|		КОНЕЦ)
		|ИЗ
		|	Документ.УвольнениеСписком.ПособияПерерасчет КАК УвольнениеПособияПерерасчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО УвольнениеПособияПерерасчет.Начисление = Начисления.Ссылка
		|ГДЕ
		|	УвольнениеПособияПерерасчет.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеПособияПерерасчет.Ссылка,
		|	УвольнениеПособияПерерасчет.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник,
		|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ НачисленияУдержанияПоСотрудникам.Сумма
		|		КОНЕЦ)
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО НачисленияУдержанияПоСотрудникам.НачислениеУдержание = Начисления.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
		|		ПО НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник = ДанныеДокументов.Сотрудник
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
		|	И НачисленияУдержанияПоСотрудникам.Регистратор В
		|			(ВЫБРАТЬ
		|				Документы.ДокументЦепочки
		|			ИЗ
		|				ВТЦепочкаУвольнений КАК Документы)
		|	И (НЕ НачисленияУдержанияПоСотрудникам.Регистратор В
		|					(ВЫБРАТЬ
		|						Документы.Ссылка
		|					ИЗ
		|						ВТДанныеДокументов КАК Документы)
		|			ИЛИ НачисленияУдержанияПоСотрудникам.Сторно)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержанияПоСотрудникам.Регистратор,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник,
		|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма),
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаТрудаВНатуральнойФорме), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме))
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)
		|					ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие)
		|				ТОГДА 0
		|			ИНАЧЕ НачисленияУдержанияПоСотрудникам.Сумма
		|		КОНЕЦ)
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО НачисленияУдержанияПоСотрудникам.НачислениеУдержание = Начисления.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
		|		ПО НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник = ДанныеДокументов.Сотрудник
		|			И НачисленияУдержанияПоСотрудникам.Период = ДанныеДокументов.МесяцНачисления
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
		|	И НЕ НачисленияУдержанияПоСотрудникам.Регистратор В
		|				(ВЫБРАТЬ
		|					Документы.ДокументЦепочки
		|				ИЗ
		|					ВТЦепочкаУвольнений КАК Документы)
		|	И (НЕ НачисленияУдержанияПоСотрудникам.Регистратор В
		|					(ВЫБРАТЬ
		|						Документы.Ссылка
		|					ИЗ
		|						ВТДанныеДокументов КАК Документы)
		|			ИЛИ НачисленияУдержанияПоСотрудникам.Сторно)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержанияПоСотрудникам.Регистратор,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Начисления.Ссылка) КАК Ссылка,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	СУММА(Начисления.ВсегоВыплат) КАК ВсегоВыплат,
		|	СУММА(Начисления.ВсегоКВыплате) КАК ВсегоКВыплате,
		|	СУММА(Начисления.НачисленоКомпенсации) КАК НачисленоКомпенсации,
		|	СУММА(Начисления.НачисленоВыходноеПособиеСохраняемыйЗаработок) КАК НачисленоВыходноеПособиеСохраняемыйЗаработок,
		|	СУММА(Начисления.ВсеДругиеНачисления) КАК ВсеДругиеНачисления
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ
		|	ВТНачисленияПредварительно КАК Начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Увольнение.Ссылка КАК Ссылка,
		|	Увольнение.Ссылка.Сотрудник.ГоловнойСотрудник КАК Сотрудник,
		|	СУММА(УвольнениеНДФЛ.Налог + УвольнениеНДФЛ.НалогСПревышения) КАК СуммаНДФЛ
		|ПОМЕСТИТЬ ВТНДФЛПредварительно
		|ИЗ
		|	ВТЦепочкаУвольнений КАК Увольнение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Увольнение.НДФЛ КАК УвольнениеНДФЛ
		|		ПО Увольнение.ДокументЦепочки = УвольнениеНДФЛ.Ссылка
		|ГДЕ
		|	НЕ Увольнение.ВТекущемПериоде
		|СГРУППИРОВАТЬ ПО
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	УвольнениеСотрудники.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеНДФЛ.Налог)
		|ИЗ
		|	ВТЦепочкаУвольненийСписком КАК Увольнение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.НДФЛ КАК УвольнениеНДФЛ
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСотрудники
		|			ПО УвольнениеНДФЛ.Ссылка = УвольнениеСотрудники.Ссылка
		|				И УвольнениеНДФЛ.ИдентификаторСтрокиСотрудника = УвольнениеСотрудники.ИдентификаторСтрокиСотрудника
		|		ПО Увольнение.ДокументЦепочки = УвольнениеНДФЛ.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Увольнение.Ссылка,
		|	УвольнениеСотрудники.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеПогашениеЗаймов.НалогНаМатериальнуюВыгоду)
		|ИЗ
		|	ВТЦепочкаУвольнений КАК Увольнение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Увольнение.ПогашениеЗаймов КАК УвольнениеПогашениеЗаймов
		|		ПО Увольнение.ДокументЦепочки = УвольнениеПогашениеЗаймов.Ссылка
		|ГДЕ
		|	УвольнениеПогашениеЗаймов.НалогНаМатериальнуюВыгоду <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	УвольнениеСпискомСотрудники.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеСпискомПогашениеЗаймов.НалогНаМатериальнуюВыгоду)
		|ИЗ
		|	ВТЦепочкаУвольненийСписком КАК Увольнение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.ПогашениеЗаймов КАК УвольнениеСпискомПогашениеЗаймов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСпискомСотрудники
		|			ПО УвольнениеСпискомПогашениеЗаймов.Ссылка = УвольнениеСпискомСотрудники.Ссылка
		|				И УвольнениеСпискомПогашениеЗаймов.ИдентификаторСтрокиСотрудника = УвольнениеСпискомСотрудники.ИдентификаторСтрокиСотрудника
		|		ПО Увольнение.ДокументЦепочки = УвольнениеСпискомПогашениеЗаймов.Ссылка
		|ГДЕ
		|	УвольнениеСпискомПогашениеЗаймов.НалогНаМатериальнуюВыгоду <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Увольнение.Ссылка,
		|	УвольнениеСпискомСотрудники.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник,
		|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма)
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
		|		ПО НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник = ДанныеДокументов.Сотрудник
		|			И НачисленияУдержанияПоСотрудникам.Период = ДанныеДокументов.МесяцНачисления
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
		|	И (НачисленияУдержанияПоСотрудникам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НДФЛ)
		|			ИЛИ НачисленияУдержанияПоСотрудникам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НДФЛСПревышения))
		|	И (НЕ НачисленияУдержанияПоСотрудникам.Регистратор В
		|					(ВЫБРАТЬ
		|						Документы.Ссылка
		|					ИЗ
		|						ВТДанныеДокументов КАК Документы)
		|			ИЛИ НачисленияУдержанияПоСотрудникам.Сторно)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержанияПоСотрудникам.Регистратор,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(НДФЛПредварительно.Ссылка) КАК Ссылка,
		|	НДФЛПредварительно.Сотрудник КАК Сотрудник,
		|	СУММА(НДФЛПредварительно.СуммаНДФЛ) КАК СуммаНДФЛ
		|ПОМЕСТИТЬ ВТНДФЛ
		|ИЗ
		|	ВТНДФЛПредварительно КАК НДФЛПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛПредварительно.Сотрудник";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УвольнениеУдержания.Ссылка КАК Ссылка,
		|	УвольнениеУдержания.Ссылка.Сотрудник.ГоловнойСотрудник КАК Сотрудник,
		|	СУММА(УвольнениеУдержания.Результат) КАК ПрочиеУдержания
		|ПОМЕСТИТЬ ВТУдержанияПредварительно
		|ИЗ
		|	Документ.Увольнение.Удержания КАК УвольнениеУдержания
		|ГДЕ
		|	УвольнениеУдержания.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеУдержания.Ссылка,
		|	УвольнениеУдержания.Ссылка.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УвольнениеУдержания.Ссылка,
		|	УвольнениеСотрудники.Сотрудник.ГоловнойСотрудник,
		|	СУММА(УвольнениеУдержания.Результат)
		|ИЗ
		|	Документ.УвольнениеСписком.Удержания КАК УвольнениеУдержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСотрудники
		|		ПО УвольнениеУдержания.Ссылка = УвольнениеСотрудники.Ссылка
		|			И УвольнениеУдержания.ИдентификаторСтрокиСотрудника = УвольнениеСотрудники.ИдентификаторСтрокиСотрудника
		|ГДЕ
		|	УвольнениеУдержания.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	УвольнениеУдержания.Ссылка,
		|	УвольнениеСотрудники.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка.Сотрудник.ГоловнойСотрудник,
		|	СУММА(Увольнение.ПогашениеЗайма)
		|ИЗ
		|	Документ.Увольнение.ПогашениеЗаймов КАК Увольнение
		|ГДЕ
		|	Увольнение.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	УвольнениеСотрудники.Сотрудник.ГоловнойСотрудник,
		|	СУММА(Увольнение.ПогашениеЗайма)
		|ИЗ
		|	Документ.УвольнениеСписком.ПогашениеЗаймов КАК Увольнение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСотрудники
		|		ПО Увольнение.Ссылка = УвольнениеСотрудники.Ссылка
		|			И Увольнение.ИдентификаторСтрокиСотрудника = УвольнениеСотрудники.ИдентификаторСтрокиСотрудника
		|ГДЕ
		|	Увольнение.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Увольнение.Ссылка,
		|	УвольнениеСотрудники.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка.Сотрудник.ГоловнойСотрудник,
		|	СУММА(Увольнение.ПогашениеПроцентов)
		|ИЗ
		|	Документ.Увольнение.ПогашениеЗаймов КАК Увольнение
		|ГДЕ
		|	Увольнение.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Увольнение.Ссылка,
		|	Увольнение.Ссылка.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Увольнение.Ссылка,
		|	УвольнениеСотрудники.Сотрудник.ГоловнойСотрудник,
		|	СУММА(Увольнение.ПогашениеПроцентов)
		|ИЗ
		|	Документ.УвольнениеСписком.ПогашениеЗаймов КАК Увольнение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСотрудники
		|		ПО Увольнение.Ссылка = УвольнениеСотрудники.Ссылка
		|			И Увольнение.ИдентификаторСтрокиСотрудника = УвольнениеСотрудники.ИдентификаторСтрокиСотрудника
		|ГДЕ
		|	Увольнение.Ссылка В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Увольнение.Ссылка,
		|	УвольнениеСотрудники.Сотрудник.ГоловнойСотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник,
		|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма)
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
		|		ПО НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник = ДанныеДокументов.Сотрудник
		|			И НачисленияУдержанияПоСотрудникам.Период = ДанныеДокументов.МесяцНачисления
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
		|	И (НачисленияУдержанияПоСотрудникам.НачислениеУдержание <> ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НДФЛ)
		|			И НачисленияУдержанияПоСотрудникам.НачислениеУдержание <> ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НДФЛСПревышения))
		|	И НЕ НачисленияУдержанияПоСотрудникам.Регистратор В
		|				(ВЫБРАТЬ
		|					Документы.Ссылка
		|				ИЗ
		|					ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержанияПоСотрудникам.Регистратор,
		|	НачисленияУдержанияПоСотрудникам.Сотрудник.ГоловнойСотрудник";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(Удержания.Ссылка) КАК Ссылка,
		|	Удержания.Сотрудник КАК Сотрудник,
		|	СУММА(Удержания.ПрочиеУдержания) КАК ПрочиеУдержания
		|ПОМЕСТИТЬ ВТУдержания
		|ИЗ
		|	ВТУдержанияПредварительно КАК Удержания
		|
		|СГРУППИРОВАТЬ ПО
		|	Удержания.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыССотрудникамиОбороты.Сотрудник КАК Сотрудник,
		|	СУММА(ВзаиморасчетыССотрудникамиОбороты.СуммаВзаиморасчетовПриход - ВзаиморасчетыССотрудникамиОбороты.СуммаВзаиморасчетовРасход) КАК СуммаВзаиморасчетовРегистратора
		|ПОМЕСТИТЬ ВТДвиженияВзаиморасчетовРегистратора
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Сотрудник В
		|				(ВЫБРАТЬ
		|					Т.Сотрудник
		|				ИЗ
		|					ВТДанныеДокументов КАК Т)) КАК ВзаиморасчетыССотрудникамиОбороты
		|ГДЕ
		|	ВзаиморасчетыССотрудникамиОбороты.Регистратор В
		|			(ВЫБРАТЬ
		|				Документы.Ссылка
		|			ИЗ
		|				ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыССотрудникамиОбороты.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник, 
		//+ГС 27.02.2023 
		|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетовКонечныйОстаток КАК КонечныйОстатокВзаиморасчетов,		
		//-ГС 27.02.2023
		|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетовНачальныйОстаток КАК ОстатокВзаиморасчетов,
		|	ВзаиморасчетыССотрудниками.Период КАК Период
		|ПОМЕСТИТЬ ВТОстаткиВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Месяц,
		|			,
		|			Сотрудник В
		|				(ВЫБРАТЬ
		|					Т.Сотрудник
		|				ИЗ
		|					ВТДанныеДокументов КАК Т)) КАК ВзаиморасчетыССотрудниками
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияВзаиморасчетовРегистратора КАК ДвиженияВзаиморасчетовРегистратора
		|		ПО ВзаиморасчетыССотрудниками.Сотрудник = ДвиженияВзаиморасчетовРегистратора.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(МИНИМУМ(ВзаиморасчетыССотрудниками.Период), МЕСЯЦ) КАК Период,
		|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
		|	СУММА(ВЫБОР
		|			КОГДА ВзаиморасчетыССотрудниками.ВидВзаиморасчетов В (ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаАванса), ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаВМежрасчетныйПериод))
		|					И ЗарплатаКВыплате.Сотрудник ЕСТЬ NULL
		|				ТОГДА ВЫБОР
		|						КОГДА ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|							ТОГДА 1
		|						ИНАЧЕ -1
		|					КОНЕЦ * ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВзаиморасчетовАвансы,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ВзаиморасчетыССотрудниками.ВидВзаиморасчетов В (ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаАванса), ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаВМежрасчетныйПериод))
		|				ТОГДА ВЫБОР
		|						КОГДА ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|							ТОГДА 1
		|						ИНАЧЕ -1
		|					КОНЕЦ * ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВзаиморасчетов
		|ПОМЕСТИТЬ ВТДвиженияВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗарплатаКВыплате КАК ЗарплатаКВыплате
		|		ПО ВзаиморасчетыССотрудниками.Регистратор = ЗарплатаКВыплате.Регистратор
		|			И ВзаиморасчетыССотрудниками.Сотрудник = ЗарплатаКВыплате.Сотрудник
		|			И (ЗарплатаКВыплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (ЗарплатаКВыплате.ДокументОснование В
		|				(ВЫБРАТЬ
		|					Документы.Ссылка
		|				ИЗ
		|					ВТДанныеДокументов КАК Документы))
		|ГДЕ
		|	ВзаиморасчетыССотрудниками.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВзаиморасчетыССотрудниками.Сотрудник В
		|			(ВЫБРАТЬ
		|				Т.Сотрудник
		|			ИЗ
		|				ВТДанныеДокументов КАК Т)
		|	И НЕ ВзаиморасчетыССотрудниками.Регистратор В
		|				(ВЫБРАТЬ
		|					Документы.Ссылка
		|				ИЗ
		|					ВТДанныеДокументов КАК Документы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыССотрудниками.Сотрудник
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА 0
		|			ИНАЧЕ -1
		|		КОНЕЦ * ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(КадровыеДанныеСотрудников.Организация КАК Справочник.Организации) КАК Организация,
		|	КадровыеДанныеСотрудников.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(КадровыеДанныеСотрудников.Организация.НаименованиеПолное КАК СТРОКА(1))) = """"
		|			ТОГДА ВЫБОР
		|					КОГДА (ВЫРАЗИТЬ(КадровыеДанныеСотрудников.Организация.НаименованиеСокращенное КАК СТРОКА(1))) = """"
		|						ТОГДА КадровыеДанныеСотрудников.Организация.Наименование
		|					ИНАЧЕ КадровыеДанныеСотрудников.Организация.НаименованиеСокращенное
		|				КОНЕЦ
		|		ИНАЧЕ КадровыеДанныеСотрудников.Организация.НаименованиеПолное
		|	КОНЕЦ КАК НазваниеОрганизации,
		|	КадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
		|	КадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
		|	КадровыеДанныеСотрудников.ФИОПолные КАК Работник,
		|	КадровыеДанныеСотрудников.ТабельныйНомер КАК ТабельныйНомер,
		|	КадровыеДанныеСотрудников.Пол КАК Пол,
		|	КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
		|	КадровыеДанныеСотрудников.Должность КАК Должность,
		|	КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
		|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
		|	КадровыеДанныеСотрудников.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер,
		|	КадровыеДанныеСотрудников.ТрудовойДоговорДата КАК ТрудовойДоговорДата,
		|	ФИОРуководителя.РасшифровкаПодписи КАК ФИОРуководителя,
		|	ФИОБухгалтера.РасшифровкаПодписи КАК БухгалтерРасшифровкаПодписи,
		|	ФИОРаботникаКадровойСлужбы.РасшифровкаПодписи КАК РаботникКадровойСлужбыРасшифровкаПодписи,
		|	&ДанныеДокументов КАК ДанныеДокументов,
		|	ЕСТЬNULL(Начисления.ВсегоВыплат, 0) КАК ВсегоВыплат,
		|	ЕСТЬNULL(Начисления.НачисленоКомпенсации, 0) КАК НачисленоКомпенсации,
		|	ЕСТЬNULL(Начисления.НачисленоВыходноеПособиеСохраняемыйЗаработок, 0) КАК НачисленоВыходноеПособиеСохраняемыйЗаработок,
		|	ЕСТЬNULL(Начисления.ВсеДругиеНачисления, 0) КАК ВсеДругиеНачисления,
		|	ЕСТЬNULL(НДФЛ.СуммаНДФЛ, 0) КАК СуммаНДФЛ,
		|	ЕСТЬNULL(Удержания.ПрочиеУдержания, 0) + ЕСТЬNULL(-ДвиженияВзаиморасчетов.СуммаВзаиморасчетовАвансы, 0) КАК ПрочиеУдержания,
		|	ЕСТЬNULL(НДФЛ.СуммаНДФЛ, 0) + ЕСТЬNULL(Удержания.ПрочиеУдержания, 0) + ЕСТЬNULL(-ДвиженияВзаиморасчетов.СуммаВзаиморасчетовАвансы, 0) КАК ВсегоУдержано,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиВзаиморасчетов.ОстатокВзаиморасчетов, 0) > 0
		|			ТОГДА ЕСТЬNULL(ОстаткиВзаиморасчетов.ОстатокВзаиморасчетов, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДолгЗаОрганизацией,
//+ГС 28.02.2023 
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиВзаиморасчетов.КонечныйОстатокВзаиморасчетов, 0) < 0
		|			ТОГДА -ЕСТЬNULL(ОстаткиВзаиморасчетов.КонечныйОстатокВзаиморасчетов, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДолгЗаРаботником,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(Начисления.ВсегоВыплат, 0) - (ЕСТЬNULL(НДФЛ.СуммаНДФЛ, 0) + ЕСТЬNULL(Удержания.ПрочиеУдержания, 0) + ЕСТЬNULL(-ДвиженияВзаиморасчетов.СуммаВзаиморасчетовАвансы, 0)) + ЕСТЬNULL(ОстаткиВзаиморасчетов.ОстатокВзаиморасчетов, 0) < 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ЕСТЬNULL(Начисления.ВсегоВыплат, 0) - (ЕСТЬNULL(НДФЛ.СуммаНДФЛ, 0) + ЕСТЬNULL(Удержания.ПрочиеУдержания, 0) + ЕСТЬNULL(-ДвиженияВзаиморасчетов.СуммаВзаиморасчетовАвансы, 0)) + ЕСТЬNULL(ОстаткиВзаиморасчетов.ОстатокВзаиморасчетов, 0)
		//|	КОНЕЦ КАК КВыплате,
		|ЕСТЬNULL(Начисления.ВсегоВыплат, 0) - (ЕСТЬNULL(НДФЛ.СуммаНДФЛ, 0) + ЕСТЬNULL(Удержания.ПрочиеУдержания, 0) + ЕСТЬNULL(-ДвиженияВзаиморасчетов.СуммаВзаиморасчетовАвансы, 0)) + ЕСТЬNULL(ОстаткиВзаиморасчетов.ОстатокВзаиморасчетов, 0) КАК КВыплате,		
//-ГС 28.02.2023						
		|	ЕСТЬNULL(ДнейКомпенсацииУдержанияОтпуска.ДнейКомпенсации, 0) КАК ДнейКомпенсации,
		|	ЕСТЬNULL(ДнейКомпенсацииУдержанияОтпуска.ДнейУдержания, 0) КАК ДнейУдержания,
		|	ДанныеДокументов.Сотрудник КАК Сотрудник,
		|	ДанныеДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ДанныеДокументов.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И ДанныеДокументов.Период = КадровыеДанныеСотрудников.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
		|		ПО ДанныеДокументов.Руководитель = ФИОРуководителя.ФизическоеЛицо
		|			И ДанныеДокументов.Ссылка = ФИОРуководителя.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОБухгалтера
		|		ПО ДанныеДокументов.Бухгалтер = ФИОБухгалтера.ФизическоеЛицо
		|			И ДанныеДокументов.Ссылка = ФИОБухгалтера.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРаботникаКадровойСлужбы
		|		ПО ДанныеДокументов.РаботникКадровойСлужбы = ФИОРаботникаКадровойСлужбы.ФизическоеЛицо
		|			И ДанныеДокументов.Ссылка = ФИОРаботникаКадровойСлужбы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисления КАК Начисления
		|		ПО ДанныеДокументов.Ссылка = Начисления.Ссылка
		|			И ДанныеДокументов.Сотрудник = Начисления.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДФЛ КАК НДФЛ
		|		ПО ДанныеДокументов.Ссылка = НДФЛ.Ссылка
		|			И ДанныеДокументов.Сотрудник = НДФЛ.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержания КАК Удержания
		|		ПО ДанныеДокументов.Ссылка = Удержания.Ссылка
		|			И ДанныеДокументов.Сотрудник = Удержания.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДнейКомпенсацииУдержанияОтпуска КАК ДнейКомпенсацииУдержанияОтпуска
		|		ПО ДанныеДокументов.Ссылка = ДнейКомпенсацииУдержанияОтпуска.Ссылка
		|			И ДанныеДокументов.Сотрудник = ДнейКомпенсацииУдержанияОтпуска.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиВзаиморасчетов КАК ОстаткиВзаиморасчетов
		|		ПО (НАЧАЛОПЕРИОДА(ДанныеДокументов.МесяцНачалаРасчетов, МЕСЯЦ) = ОстаткиВзаиморасчетов.Период)
		|			И ДанныеДокументов.Сотрудник = ОстаткиВзаиморасчетов.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияВзаиморасчетов КАК ДвиженияВзаиморасчетов
		|		ПО (НАЧАЛОПЕРИОДА(ДанныеДокументов.МесяцНачалаРасчетов, МЕСЯЦ) = ДвиженияВзаиморасчетов.Период)
		|			И ДанныеДокументов.Сотрудник = ДвиженияВзаиморасчетов.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	Сотрудник";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДанныеДокументов КАК ДанныеДокументов", "ДанныеДокументов.*");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
	
КонецФункции
