
&НаСервере
Процедура ГСИ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавляемыеРеквизиты = Новый Массив; 
	НовыйРеквизит = Новый РеквизитФормы("ГСИ_ОтключитьСообщенияДляПользователяЭДО",Новый ОписаниеТипов("Булево")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭтаФорма.ГСИ_ОтключитьСообщенияДляПользователяЭДО = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ОбщиеНастройкиПользователя", 
		"ГСИ_ОтключитьСообщенияДляПользователяЭДО",
		Ложь);
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ГСИ_ОтключитьСообщенияДляПользователяЭДО", Тип("ПолеФормы"),Элементы.ГруппаЗапускИЗавершениеРаботы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "ГСИ_ОтключитьСообщенияДляПользователяЭДО";
	НовыйЭлемент.Заголовок = "Отключить сообщения для пользователя ЭДО"; 
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
КонецПроцедуры

&НаСервере
&После("ЗаписатьНастройкиНаСервере")
Процедура ГСИ_ЗаписатьНастройкиНаСервере(ПараметрыКлиента)
	СохранитьСвойстваКоллекции("ОбщиеНастройкиПользователя", ЭтотОбъект,
		"ГСИ_ОтключитьСообщенияДляПользователяЭДО");
КонецПроцедуры
