#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ФиксацияВторичныхДанныхВДокументах

&Вместо("ЗаполнитьПриоритеты")
Функция ГСИ_ЗаполнитьПриоритеты(ПараметрыФиксации) 
	
	Реквизиты = Новый Структура("ПриоритетУДанныхВходящегоЗапроса");
	
	// Если есть только одна ссылка из двух - то приоритет у тех данных, по которым есть ссылка.
	Если Не ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитаШапки(ЭтотОбъект, "ПриоритетУДанныхВходящегоЗапроса");
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Ложь;
		Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитаШапки(ЭтотОбъект, "ПриоритетУДанныхВходящегоЗапроса");
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Истина;
		Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	КонецЕсли;
	
	ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
	
	ДатаВходящегоЗапроса = ДанныеВходящегоЗапроса.ДатаСообщения;
	
	Если ЗначениеЗаполнено(ДатаНачалаСобытия) Тогда
		ДатаСобытия = ДатаНачалаСобытия;
	ИначеЕсли ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		ДатаСобытия = ДатаВходящегоЗапроса;
	ИначеЕсли ЗначениеЗаполнено(Дата) Тогда
		ДатаСобытия = Дата;
	Иначе
		ДатаСобытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Дата когда законодательно появилась возможность запрашивать данные СФР для расчета пособий.
	ДатаНачалаИспользованияДанныхСФР = '20230101';
	// Ориентировочная дата когда во входящем запросе появился достаточный объем сведений для расчета пособий.
	//+ГС 27.05.2024 
	//ДатаНачалаИспользованияДанныхСФРДляРасчетаПособий = '20230601';	
	ДатаНачалаИспользованияДанныхСФРДляРасчетаПособий = '20240901';
	//-ГС 27.05.2024
	Если ДатаСобытия < ДатаНачалаИспользованияДанныхСФР
		Или ДатаВходящегоЗапроса < ДатаНачалаИспользованияДанныхСФРДляРасчетаПособий Тогда
		// До 2023 года приоритет был у первичного документа.
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ПервыйРасчетныйГодЗаработок)
		И Не ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ВторойРасчетныйГодЗаработок) Тогда
		// Во входящем запросе недостаточно данных.
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Ложь;
	ИначеЕсли СтраховательИзменилРасчетныйПериод(ДанныеВходящегоЗапроса, РеквизитыПервичногоДокумента()) Тогда
		// Расчетный период должен совпадать у Фонда и страхователя.
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Ложь;
	Иначе
		// Можно использовать данные входящего запроса.
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Истина;
	КонецЕсли;
	
	ЕстьИзменения = ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	Если ЕстьИзменения Тогда
		ДополнительныеСвойства.Удалить("ДанныеЗаполняемыеИзПервичногоДокумента");
	КонецЕсли;
	Возврат ЕстьИзменения;
	
КонецФункции

#КонецОбласти 
#КонецЕсли
