
&НаСервере
Процедура ГСИ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ГСИ_УправлениеФормой.СоздатьТаблицуФормы(ЭтаФорма);          
	ГСИ_УправлениеФормой.ЗаполнитьТаблицуФормы(ЭтаФорма);
	ГСИ_УправлениеФормой.УстановитьВидимостьРеквизитаТаблицы(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ГСИ_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ГСИ_УправлениеФормой.ЗаписатьТаблицу(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаДнейПоМесяцамПериодПриИзменении(Элемент)
	  Элементы.ТаблицаДнейПоМесяцам.ТекущиеДанные.Период=НачалоМесяца(Элементы.ТаблицаДнейПоМесяцам.ТекущиеДанные.Период);
КонецПроцедуры
