
#Область ПрограммныйИнтерфейс
// ГСИ получить информацию о входящих сообщениях для пользователя ЭДО.
&Вместо("ПолучитьИнформациюОВходящихСообщенияхДляПользователяЭДО")
Процедура ГСИ_ПолучитьИнформациюОВходящихСообщенияхДляПользователяЭДО() Экспорт
	ГСИ_ОтключитьСообщенияДляПользователяЭДО = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"ОбщиеНастройкиПользователя", 
		"ГСИ_ОтключитьСообщенияДляПользователяЭДО",
		Ложь);
	Если ГСИ_ОтключитьСообщенияДляПользователяЭДО Тогда
		Возврат;
	КонецЕсли;	
		
	ПродолжитьВызов();

КонецПроцедуры
#КонецОбласти
