#Область ПрограммныйИнтерфейс
// Получить разделитель строк.
// 
// Возвращаемое значение:
//  Строка - Получить разделитель строк
Функция ПолучитьРазделительСтрок() Экспорт
	Возврат ";";
КонецФункции	

// Получить разделитель в строке.
// 
// Возвращаемое значение:
//  Строка - Получить разделитель в строке
Функция ПолучитьРазделительВСтроке() Экспорт
	Возврат "^";
КонецФункции	

// Получить наименование доп реквизита.
// 
// Возвращаемое значение:
//  Строка - Получить наименование доп реквизита
Функция ПолучитьНаименованиеДопРеквизита() Экспорт 
	Возврат "ТаблицаДнейПоМесяцам";
КонецФункции
#КонецОбласти	