
&Вместо("ДанныеДляПечатиЗапискиРасчетаТ61")
Функция ГСИ_ДанныеДляПечатиЗапискиРасчетаТ61(МассивОбъектов)
	ДанныеДляПечати = ПродолжитьВызов(МассивОбъектов); 
	//корректируем данные для печати
	Если ДанныеДляПечати.Количество()>0 И ДанныеДляПечати[0].Данные.Количество()>0 Тогда
		СтруктураДанных=ДанныеДляПечати[0].Данные[0];
		ДолгЗаРаботником=СтруктураДанных.ВсегоВыплат-СтруктураДанных.ВсегоУдержано;
		Если ДолгЗаРаботником<0 Тогда
			СтруктураДанных.ДолгЗаРаботником=-ДолгЗаРаботником;
			СтруктураДанных.КВыплате=ДолгЗаРаботником;
		КонецЕсли;
	КонецЕсли;	
	Возврат ДанныеДляПечати;
	
КонецФункции
